tap 'phinze/cask'
brew 'brew-cask'
brew 'mongodb'
brew 'mysql'
brew 'ag'
brew 'zsh'
brew 'git'
brew 'git-flow'
brew 'hub'
brew 'autojump'
brew 'the-silver-searcher'
brew 'w3m'
brew 'wget'
brew 'openssl'
brew 'readline'
brew 'autoconf'
cask 'google-chrome'
cask 'sourcetree'
cask 'alfred'
cask 'dropbox'
cask 'onepassword'
cask 'xbench'
