Angular.ng-template
DavidAnson.vscode-markdownlint
PKief.material-icon-theme
PeterJausovec.vscode-docker
abierbaum.vscode-file-peek
alefragnani.project-manager
christian-kohler.path-intellisense
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
johnpapa.Angular2
leizongmin.node-module-intellisense
ms-python.python
njpwerner.autodocstring
octref.vetur
pranaygp.vscode-css-peek
saikou9901.evilinspector
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
skattyadz.vscode-quick-scope
sysoev.language-stylus
vscodevim.vim
