""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"# Vim設定の詳細
""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"設定ごとの詳細を書きます。
""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"## プラグインの提供機能別索引
""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"* [Vimでもともと設定可能な代表的オプションが知りたい - 基本設定](#basics) 
"* [Vimプラグインを管理したい - NeoBundle](#neobundle) 
"* [ファイルに変更があったら自動的にセーブしたい - オートセーブ](#autosave) 
"* [ノーマルモードでのコロンの入力が面倒 - セミコロンをコロン扱いにする](#important_keybind)
"* [インサートモード終了時にEscを押すのが面倒 - 特定の文字入力でインサートモードを終了する](#important_keybind)
""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""


""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"## <a name="basics">基本設定
"`````````````````````````````````````````````````````````````
set encoding=utf-8                 " 文字コードをutf-8に設定する
set fileencodings=ucs-bom,utf-8,iso-2022-jp-3,iso-2022-jp,eucjp-ms,euc-jisx0213,euc-jp,sjis,cp932 " ファイルを開いたときに試行するエンコード
set ambiwidth=double               " 全角文字の扱いを改善
set number                         " ファイル左に行番号を表示する
set relativenumber                 " カーソルの位置する行からの差分行数を表示する。set number時の挙動を一部上書きする
set smarttab                       " 頭の余白内で <tab> を打ち込むと空白を挿入
set expandtab                      " tab文字をスペースに展開
set tabstop=4                      " <tab>を押したときの空白文字数
set shiftwidth=4                   " インデント時の空白数
set infercase                      " 小文字で打った単語でも大文字で補完できるようにする
set ignorecase                     " 検索で大文字小文字を区別しない
set textwidth=0                    " 勝手に改行しないようにする
set noswapfile                     " スワップファイルを作成しない
set autoread                       " 他のプログラム等から書き換えられたら自動再読み込み
set nobk                           " バックアップの作成をしないようにする
set ttyfast
set cursorline                     " 現在行をハイライト
set cursorcolumn
set autochdir                      " カレントディレクトリを自動変更
set noundofile
set backspace=indent,eol,start
"`````````````````````````````````````````````````````````````

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" ## <a name="builtin">Vimビルトインの追加機能読み込み
"`````````````````````````````````````````````````````````````
" Match Complex Parentheses
source $VIMRUNTIME/macros/matchit.vim
"`````````````````````````````````````````````````````````````

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"## <a name="autosave">ファイルに変更を加えたら自動的にセーブする - Auto-Save 
"[vim-scripts/vim-auto-save](https://github.com/vim-scripts/vim-auto-save)  
"バージョン管理システムを利用しているのならば、毎回ファイルをセーブするコマンドを打つのは時間の無駄です。
"ファイルに変更があったら即セーブするようにしてしまいましょう。
"`````````````````````````````````````````````````````````````
let g:auto_save = 1 "デフォルトで有効にする
"`````````````````````````````````````````````````````````````

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"## <a name="important_keybind">影響の大きいキー設定
"### ノーマルモードではセミコロンをコロン扱いする
"`````````````````````````````````````````````````````````````
nnoremap ; :
"`````````````````````````````````````````````````````````````
"### インサートモードで"j"を２回押すとノーマルモードに戻る
"`````````````````````````````````````````````````````````````
inoremap jj <ESC> " in insert mode, jj means <ESC>.
"`````````````````````````````````````````````````````````````

"`````````````````````````````````````````````````````````````
"### 現在のバッファと同一プロジェクト内のファイル検索
"キーバインド: ,p
"VCSの同一管理下にあるファイルを同一プロジェクトとみなし、
"同一プロジェクト内のファイル検索を行います。
"`````````````````````````````````````````````````````````````
nnoremap <silent> ,p :<C-u>call <SID>unite_project('-start-insert')<CR>

function! s:unite_project(...)
  let opts = (a:0 ? join(a:000, ' ') : '')
    let dir = unite#util#path2project_directory(expand('%'))
      execute 'Unite' opts 'file_rec:' . dir
endfunction
"`````````````````````````````````````````````````````````````

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"## ローカル設定用vimrc読み込み
"端末単位での設定や、パスワードの記載等をvimrc.localに記載する
"`````````````````````````````````````````````````````````````
if filereadable(expand('~/.vimrc.local'))
  source ~/.vimrc.local
endif
"`````````````````````````````````````````````````````````````
